[
 {
  "recipeID": 1,
  "title": "Grilled Flank Steak",
  "tags": [
   "Beef",
   "Dinner"
  ],
  "author": "Lee Funke",
  "description": "Marinated flank steak makes dinner an ace in the hole. Mix a quick marinade with soy sauce, honey, garlic, and pepper for a grilled flank steak recipe you will go to again and again.",
  "serving": "4",
  "ingredients": {
   "Flank steak": "2 lb.",
   "Coarse salt": "1/2 teaspoon",
   "Ground black pepper": "1/2 teaspoon",
   "Soy sauce": "1/2 cup",
   "Honey": "2–3 tablespoons"
  },
  "instructions": "1) Begin by placing the flank steak onto a large cutting board. Use a meat tenderizer to even out your cut of meat. The goal here isn’t a certain thickness, rather to get everything even.\r\n2) Next, transfer the flank steak onto a large baking sheet with edges. You will be marinating the meat on the baking sheet.\r\n3) Sprinkle both sides of the flank steak with salt and pepper and massage the spices into the meat.\r\n4) Next, whisk together the soy sauce and honey and pour the marinade over the flank steak.\r\n5) Cover the flank steak with plastic wrap and place it in the refrigerator for at least 2 hours, flipping the flank steak at 1 hour to make sure both sides of the flank steak have time to marinate. Alternatively, you can use a large, gallon-size bag or casserole dish.\r\n6) Preheat the grill to 450ºF – 500ºF.\r\n7) Remove the meat from the refrigerator and let it sit at room temperature for at least 15 minutes.\r\n8) Next, shake out any excess marinade from the flank steak and then sear the steak over direct heat for 1-2 minutes on each side (the grill should be very hot).\r\n9) Then, move the flank steak over to indirect heat and cook for about 10 minutes, flipping after 5 minutes. This will vary on how hot your grill is. Be sure to check the internal temperature of the steak at 5 minutes, 10 minutes, and so on until the internal temperature reaches about 130º – 135º for a medium-rare flank steak.\r\n10) Remove the steak from the grill and let it rest for 5 minutes.\r\n11) Slice the flank steak into strips by cutting the meat across the grain of the steak to break up the muscle fibers in the steak.\r\n12) Serve and enjoy!",
  "image": "default-recipe.jpg",
  "img": "https://www.simplyrecipes.com/thmb/998iTM_FyoQM15gWbUyX5xd_os8=/720x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2015__06__grilled-marinated-flank-steak-horiz-a-1200-de7ebb9b530242468fdc014bd45696e9.jpg"
 },
 {
  "recipeID": 2,
  "title": "Spatchcock Chicken",
  "tags": [
   "Chiken",
   "Dinner"
  ],
  "description": "This Spatchcock Chicken recipe is our favorite way to roast a whole chicken. Every part of the roasted chicken turns out juicy and so flavorful with that garlic herb butter. This one pan chicken dinner is easy and so delicious!",
  "author": "Linley Richter",
  "serving": "4-6",
  "ingredients": {
   "Whole chicken": "3 – 4-lb.",
   "salt (separated)": "1.5 teaspoon",
   "olive oil, separated": "3 tablespoons",
   "white onion, chopped": "½ ",
   "garlic, peeled and smashed ": "4 cloves",
   "fresh thyme": "10 sprigs",
   "dry white wine ": "¼ cup",
   "broth, any kind (separated)": "1.5 cups",
   " lemon juice ": "2 teaspoons",
   "cornstarch": "2 teaspoons"
  },
  "instructions": "First, prepare the chicken seasoning. Mix together all spices and set aside.\r\nNext, remove the chicken from the packaging and place the chicken on a clean, dry cutting board. \r\nRemove excess moisture from the chicken with a paper towel.\r\nTo spatchcock the chicken, set the chicken breast-side down on a cutting board and use very sharp kitchen shears to begin cutting down one side of the spine through the ribs and then repeat on the other side of the spine. Discard the spine. \r\nFlip the chicken over onto the chicken breasts and use your hands to press on the middle of the bird pressing down firmly to flatten the chicken. \r\nPlace the chicken on a large plate and carefully separate the chicken meat from the chicken skin with your hand. \r\nCarefully rub 1 teaspoon salt on the chicken meat under the skin being sure the chicken meat is covered with salt. \r\nNext, season the whole chicken with the all purpose chicken seasoning. Be sure the whole chicken is covered (skin, legs, thighs, etc.). Then, refrigerate the chicken for at least 2 hours or overnight.\r\nWhen you are ready to cook, preheat the oven to 425ºF and line a baking sheet with aluminum foil. \r\nRemove the chicken from the refrigerator and let it come to room temperature. \r\nPlace the onion, garlic, thyme, white wine, ½ cup of broth, and 1 tablespoon olive oil on top of the aluminum foil and sprinkle with the remaining ½ teaspoon salt.  \r\nPlace a metal rack on top of the foil and vegetables and carefully place the whole chicken flat on top of the metal rack breast-side up. \r\nRub the chicken with the additional 2 tablespoons of oil. Be sure to really massage the oil into the chicken. \r\nPlace the chicken in the oven and bake at 425ºF for 35-45 minutes or until the whole bird has an internal temperature of at least 160º. Make sure to take the temperature at the thickest parts.\r\nRemove the chicken from the oven and let the chicken rest for at least 15 minutes. Your chicken should continue to cook 5ºF to make the internal temperature 165ºF.\r\nWhile the chicken is resting, prepare the sauce. Add all of the cooked vegetables, liquid, and herbs from the bottom of the pan into a small saucepan along with the rest of the broth (1 cup). \r\nBring the sauce to a boil and then turn the heat to medium/low and add the lemon juice. \r\nThen, carefully sprinkle the cornstarch into the sauce and whisk. Let the sauce cook over medium heat until thick. Remove from heat and discard the herb stems. \r\nCarve the chicken and serve with the sauce. ",
  "image": "default-recipe.jpg",
  "img": "https://natashaskitchen.com/wp-content/uploads/2018/02/Roasted-Spatchcock-Chicken-Recipe-6-768x1152.jpg"
 },
 {
  "recipeID": 3,
  "title": "Mom's Yeast Rolls",
  "tags": [
   "Grain"
  ],
  "author": "Kathy",
  "img": "http://images.media-allrecipes.com/userphotos/250x250/5461.jpg",
  "serving": 2,
  "description": "This is the best bread recipe.  Light and fluffy rolls that melt in your mouth. Can be used to make loaves or cinnamon rolls.",
  "ingredients": {
   "": ""
  },
  "instructions": "Melt margarine in hot water. Add sugar and salt and stir. Add cold water and yeast. Stir to dissolve yeast. Add 3 cups flour and mix. Add eggs and 2 1/2 - 3 cups more flour. Mix, cover and let rise until dough doubles in size. Punch down and let rise 30 more minutes or until doubles. Make walnut size balls of dough. Place about 2 inches apart in well-buttered 9 x 13 inch pan. Bake in a preheated 350 degrees F (175 degrees C) oven for 30-45 minutes. Brush top of rolls with margarine while hot.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 4,
  "title": "Sweet Potato Bread I",
  "tags": [
   "Grain"
  ],
  "author": "Mary E. Crain",
  "img": "http://images.media-allrecipes.com/userphotos/250x250/394676.jpg",
  "serving": 2,
  "description": "A Southern delight with a 'more-ish'  taste.  One bite and you want more! This bread freezes well.",
  "ingredients": {
   "": ""
  },
  "instructions": "Combine sugar and oil; beat well. Add eggs and beat. Combine flour, baking soda, salt, cinnamon and nutmeg. Stir flour mixture into egg mixture alternately with water. Stir in sweet potatoes and chopped nuts. Pour batter into greased 9x5 inch loaf pan (or 2 small loaf pans). Bake at 350 degrees F (175 degrees C) for about one hour.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 5,
  "title": "Orange Buns",
  "tags": [
   "Grain"
  ],
  "author": "DeeDee",
  "img": "http://images.media-allrecipes.com/userphotos/560x315/4499841.jpg",
  "serving": 2,
  "description": "You can make these into braids or buns. Frost with an orange icing and sprinkle some nuts on top, if desired.",
  "ingredients": {
   "": ""
  },
  "instructions": "Stir butter and 1 teaspoon sugar into the hot milk until butter is melted. When mixture is lukewarm, stir in yeast and set aside for 5 minutes. When mixture is creamy, transfer to a large mixing bowl. Mix in 2 cups of bread flour. Add 1/2 cup sugar, eggs, orange juice, orange zest, and salt and beat until combined. Add remaining flour, mixing well after each addition, until it pulls away from the sides of the bowl. Knead for about 10 minutes. Transfer dough to a greased bowl, cover with plastic wrap, and let rise until doubled, about 1 hour. If time permits, you can punch dough down, cover it, and let it rise again. Transfer dough to a lightly floured work surface. Cut dough into 3 balls, cover with plastic wrap, and let rest for 10 minutes. Preheat oven to 375 degrees F (190 degrees C). Lightly grease two baking sheets or line with parchment paper. Shape each piece of dough into braided loaves or buns; place on baking sheets. Let rise until doubled, about 30 minutes. Bake until rolls or loaves are golden brown, 10 to 12 minutes for individual buns, about 20 minutes for braids. Frost rolls, if desired (see Cook's Note) or sprinkle with confectioners' sugar.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 6,
  "title": "Cornish Splits",
  "tags": [
   "Grain"
  ],
  "author": "Linda Jackman",
  "img": "http://images.media-allrecipes.com/userphotos/560x315/1843306.jpg",
  "serving": 2,
  "description": "Delicious!  This recipe originated in Cornwall, England.",
  "ingredients": {
   "": ""
  },
  "instructions": "In a small bowl, dissolve the yeast in the milk and add the sugar. In another bowl, sift the flour and salt together and add the cooled melted butter. Add the yeast mixture to the flour mixture, and turn out onto a floured counter and knead until the dough is smooth and elastic. Place the dough in an oiled bowl, cover with a clean towel and let rise in a warm, draft free place to 45 minutes. Turn dough out onto the freshly floured board and shape into 9 balls. Place dough balls into a buttered and floured 9 inch square pan. Let them sit, covered for another 15 minutes to rise again. Preheat the oven to 425 degrees F (220 degrees C). Bake for 15-20 minutes until browned and puffed. Split open and serve warm.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 7,
  "title": "Jalapeno Cheese Bread",
  "tags": [
   "Grain"
  ],
  "author": "DeeDee",
  "img": "http://images.media-allrecipes.com/userphotos/560x315/3875224.jpg",
  "serving": 2,
  "description": "A rich and spicy bread!",
  "ingredients": {
   "": ""
  },
  "instructions": "In a very large bowl, combine 7 cups of flour, cheese, jalapenos, 7 tablespoons sugar and the salt; mix well. In a separate bowl, combine the water, yeast and remaining 1 tablespoon sugar. Let sit about 10 minutes; stir until all yeast is dissolved. Add the oil to the liquid mixture, stirring . Add half of the liquid mixture to the flour mixture. Mix with hands to moisten flour as much as possible. Add remaining liquid mixture to dough and mix until flour is thoroughly incorporated. Turn onto a lightly floured surface and knead by hand until smooth and elastic to the touch, about 15 minutes, gradually adding only enough additional flour to keep dough from sticking. Place in a large greased bowl and invert dough so top is greased; cover with a dry towel and let stand in a warm place (90 - 100F) until doubled in size, about 1 hour. Punch down dough. To Make Bread: Divide dough into 3 equal portions. Form each into a ball, then stretch out dough with both hands and tuck edges under to form a smooth surface. Pop any large air bubbles by pinching them. Form into loaves. (Note: I like to use a rolling pin and roll out dough, which pops all bubbles easily and quickly.) Place in 3 greased 8 1/2 x 4 1/2 inch loaf pans. Cover with towel again and allow to rise until almost doubled in size, about 45 minutes to 1 hour. Bake at 325 degrees F (165 degrees C) until dark brown and done, about 1 hour, rotating the pans after 25 minutes for more even browning. Remove from pan as soon as bread will easily lift out, after about 5 to 10 minutes. Let cool about 1 hour before slicing.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 8,
  "title": "Dee's Health Bread",
  "tags": [
   "Grain"
  ],
  "author": "Dee Dee",
  "img": "http://images.media-allrecipes.com/userphotos/250x250/111116.jpg",
  "serving": 2,
  "description": "Whole wheat bread with sunflower seeds, cracked wheat, and honey.",
  "ingredients": {
   "cracked wheat": "1/4 cup"
  },
  "instructions": "In a small bowl, dissolve the yeast and sugar in 1/2 cup warm water. In a large bowl, mix remaining 3 1/2 cups warm water, honey, molasses, oil, eggs and lemon juice. Mix well. Add yeast mixture and stir. Gradually add 5 cups whole wheat flour beating well after each addition. Add the flax, cracked wheat and sunflower seeds, stir well. Let stand for 20 minutes, until mixture is very light. Stir in salt and the rest of the flours until dough pulls away from the sides of the bowl. Knead 10 to 15 minutes until dough is smooth and elastic. Put into a greased bowl and cover, let rise in the oven with light on until doubled, about 1 hour. Punch down and shape into 6 round balls. Cover and let rest for 20 minutes. Form into loaves and let rise covered in oven until doubled. Bake at 375 degrees F (190 degrees C) 25-35 minutes.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 9,
  "title": "Oatmeal Bread I",
  "tags": [
   "Grain"
  ],
  "author": "DeeDee",
  "img": "http://images.media-allrecipes.com/userphotos/250x250/823523.jpg",
  "serving": 2,
  "description": "Dough needs to rise overnight.",
  "ingredients": {
   "": ""
  },
  "instructions": "Combine oats, molasses, oil, salt and boiling water. Let cool to about 105 degrees F. Dissolve the yeast in the warm water and let stand for 5 minutes or until creamy. Stir the yeast into oat mixture and mix well. Add whole wheat flour, 2 cups bread flour, and the eggs. Mix until well combined. Stir in enough of the remaining flour to make a soft dough. Turn dough out to a floured counter and knead for about 10 minutes. Place the dough in a well-greased bowl and cover with greased plastic wrap. Let the dough rest in the refrigerator overnight. Preheat oven to 375 degrees F (190 degrees C). Grease 3 regular loaf pans and 4 mini loaf pans. Transfer the dough onto a floured surface and divide it into 4 pieces. Shape the dough into loaves and place them in the pans, seam-side down. Let rise until doubled, about 90 minutes. Bake in the preheated oven until the loaves are golden brown and sound hollow when tapped, about 30 minutes.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 10,
  "title": "Strawberry Bread I",
  "tags": [
   "Grain"
  ],
  "author": "Mary E. Crain",
  "img": "http://images.media-allrecipes.com/userphotos/250x250/347834.jpg",
  "serving": 2,
  "description": "A bread you MUST try!  This is one you'll want to keep on hand.",
  "ingredients": {
   "": ""
  },
  "instructions": "Grease and flour a 9 x 5 inch pan well. Preheat oven to 350 degrees F (175 degrees C). In a large mixing bowl, sift together sugar, flour, cinnamon, salt, and baking soda. In a smaller bowl, beat the eggs and oil. Stir in pecans and strawberries. Add egg mixture to the sifted ingredients, and stir until just combined. Bake for 1 hour, or until tester inserted in the center comes out clean.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 11,
  "title": "Sun Dried Tomato and Asiago Cheese Bread",
  "tags": [
   "Grain"
  ],
  "author": "Marlene Rosensweig",
  "img": "http://images.media-allrecipes.com/userphotos/250x250/3010.jpg",
  "serving": 2,
  "description": "Tomato and cheese healthful, low-fat bread for the bread machine. You may substitute wheat bran for the amaranth flour if you wish.",
  "ingredients": {
   "freshly ground black pepper": "1/2 teaspoon"
  },
  "instructions": "Place all ingredients into bread machine in order given. Bake according to bread machine directions for regular bake.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 12,
  "title": "Hawaiian Sweet Bread",
  "tags": [
   "Grain"
  ],
  "author": "Melanie",
  "img": "http://images.media-allrecipes.com/userphotos/560x315/2692064.jpg",
  "serving": 2,
  "description": "Flavorful, light sweet bread that is great by itself, or for french toast and summer sandwiches.",
  "ingredients": {
   "": ""
  },
  "instructions": "Measure ingredients into the bread machine in the order suggested by the manufacturer. Set machine for dough. Place dough in a 9x5 inch loaf pan. Allow to rise until doubled. Preheat the oven to 350 degrees F (175 degrees C). Bake in the preheated oven for about 30 minutes. Crust should be golden and bread should sound hollow when thumped.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 13,
  "title": "The Best Corn Bread You'll Ever Eat",
  "tags": [
   "Grain"
  ],
  "author": "Debbie Rowe",
  "img": "http://images.media-allrecipes.com/userphotos/560x315/2985865.jpg",
  "serving": 2,
  "description": "A soft, moist cornbread center with a crunchy crust.",
  "ingredients": {
   "": ""
  },
  "instructions": "Heat oven to 425 degrees F (220 degrees C). Grease a 9 inch iron skillet. In a large bowl, beat the egg. Add milk, oil, sour cream, cream corn, and cornmeal mix; stir until cornmeal is just dampened. Pour batter into greased skillet. Bake for 25 to 30 minutes, or until knife inserted in center comes out clean.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 14,
  "title": "No Knead Refrigerator Rolls",
  "tags": [
   "Grain"
  ],
  "author": "Debbie Rowe",
  "img": "http://images.media-allrecipes.com/userphotos/250x250/359621.jpg",
  "serving": 2,
  "description": "A light fluffy yeast roll that melts in your mouth.",
  "ingredients": {
   "": ""
  },
  "instructions": "In a large bowl, dissolve yeast in warm water and set aside to proof. In another bowl, mix together sugar, salt, shortening, and egg with an electric mixer at low speed. Add mixture to yeast, and stir in flour. The last 3 cups of flour will have to be mixed in by hand. Cover dough with a damp cloth, and place in refrigerator. Punch down occasionally as dough rises. You can leave dough in refrigerator overnight. Two hours before baking, shape the dough into rolls. Place on greased pans, baking trays or muffin pans. Let rise 2 hours. Bake at 400 degrees F ( 205 degrees C) for 8 to 10 minutes.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 15,
  "title": "Sourdough Starter I",
  "tags": [
   "Grain"
  ],
  "author": "Becky Richardson",
  "img": "http://images.media-allrecipes.com/userphotos/250x250/906669.jpg",
  "serving": 2,
  "description": "A starter good for any sourdough recipe.",
  "ingredients": {
   "": ""
  },
  "instructions": "Combine instant potatoes, sugar, water, and yeast in a covered container. Let the starter sit on a counter for 5 days, stirring daily with a wooden spoon. On the morning of the fifth day, feed the starter with 3 tablespoons instant potatoes, 3 tablespoons sugar, and 1 cup warm water. In the evening, take out 1 cup of the starter to use in a sourdough recipe. Refrigerate the remaining starter. Every five days, feed the starter 3 tablespoons instant potatoes, 3 tablespoons sugar and 1 cup water. If starter is to be used in a recipe, let the fed starter rest at room temperature 6 hours before use. If starter is not being used in a recipe, keep refrigerated and discard 1 cup of starter after each feeding.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 16,
  "title": "Sourdough Bread I",
  "tags": [
   "Grain"
  ],
  "author": "Becky Richardson",
  "img": "http://images.media-allrecipes.com/userphotos/560x315/4525477.jpg",
  "serving": 2,
  "description": "Sour dough bread that takes time to prepare, but worth the wait!!",
  "ingredients": {
   "": ""
  },
  "instructions": "Mix sugar, corn oil, salt, water, and 1 cup of sourdough starter together in a large bowl. Sift the flour and add to the mixture. Grease or oil the dough. Place the dough in an oiled bowl, cover, and let rise overnight. The next day, knead the dough for 10 minutes. Divide in half, and place into two greased 4 x 8 inch bread pans. Allow the dough to double in size. Bake at 350 degrees F (175 degrees C) for 40 to 45 minutes, or until bread is golden brown and taps hollow. Turn out to cool on wire racks.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 17,
  "title": "Dilly Bread",
  "tags": [
   "Grain"
  ],
  "author": "ZIPPY",
  "img": "http://images.media-allrecipes.com/userphotos/560x315/2317716.jpg",
  "serving": 2,
  "description": "A wonderful savory yeast bread.  There is no messy kneading; it rises in the saucepan!",
  "ingredients": {
   "cups all-purpose flour": "2 1/4"
  },
  "instructions": "Stir the yeast into the warm water, and add a pinch of sugar. Set aside to proof. In a large saucepan, warm the cottage cheese and margarine until the fat is melted. Remove from heat, and add sugar, onion flakes, dill seed, salt, and soda. Mix in egg and dissolved yeast. Stir in flour for a stiff dough. Place dough in a greased bowl, and turn several times to thoroughly coat. Let rise until double in size in a warm place, usually 50 to 60 minutes. Stir the dough until it is deflated. Place into an 8 inch round, buttered 2 quart casserole. Let rise 30 to 40 minutes in a warm place. Bake at 350 degrees F (175 degrees C) for 40 to 50 minutes until golden brown. Brush top with melted margarine. Sprinkle lightly with salt.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 18,
  "title": "Pumpkin Bread I",
  "tags": [
   "Grain"
  ],
  "author": "Lynn Borden",
  "img": "http://images.media-allrecipes.com/userphotos/250x250/918150.jpg",
  "serving": 2,
  "description": "This is recipe that I modified several years ago to lower the calories and fat. Also, by using 3 medium loaf pans instead of one regular loaf pan, the bread is eaten before it dries out. I freeze the other two loaves.",
  "ingredients": {
   "chopped walnuts (optional)": "1/2 cup"
  },
  "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease three 7 1/2 x 3 1/2-inch loaf pans. In a large mixing bowl combine the flour, soda, salt, baking powder, sugar, cinnamon, and pumpkin pie spice. Stir well. Add applesauce, eggs, pumpkin, and water. Mix batter until well combined. Stir in nuts. Pour batter into prepared pans. Bake until tester inserted in the center of each loaf comes out clean, 50 to 60 minutes.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 19,
  "title": "Sy's Challah",
  "tags": [
   "Grain"
  ],
  "author": "Sy Dolnick",
  "img": "http://images.media-allrecipes.com/userphotos/560x315/1141764.jpg",
  "serving": 2,
  "description": "Virtually fail-proof recipe designed for ease of preparation and maximum flavor.  NOT sweet, but may be sweetened by using 1/2 cup sugar instead of 1/4 cup.",
  "ingredients": {
   "": ""
  },
  "instructions": "Place sugar, salt, and oil in either a mixing bowl for an electric mixer with a dough hook or any large bowl. Add hot water, and stir to dissolve the sugar and salt. Stir in yeast, and let stand until mixture gets foamy. Add slightly beaten eggs. If using an electric mixer, add 4 1/2 cups of flour to the yeast mixture. Mix until flour is mixed in, and dough gets stringy. This stringiness indicates that the gluten has developed. Continue to add flour until dough is all on dough hook; 1 or 2 cups is usually sufficient. Let hook continue to knead for several minutes. Dough should be smooth and elastic. To knead by hand, stir 4 1/2 cups of flour in to the yeast mixture. Turn soft dough onto lightly floured surface, and work in 1 to 2 cups of flour. Knead until smooth and elastic, about 8 to 10 minutes. Place dough into a greased bowl, and turn several times to coat the surface. Cover bowl with a damp cloth. Let dough rise until doubled in bulk. Punch down after first rising, and allow to rise a second time. The first rising is about 1 hour, the second about 45 minutes. Two risings makes for a better bread, but if time is a problem just do one. Divide dough in half, and divide each half into three or four equal parts. Make two braids, and place both breads on a greased baking sheet. Cover, and allow to rise until doubled. Brush with beaten egg. Sprinkle with poppy seeds, if desired. Bake at 350 degrees F (175 degrees C) for 35 minutes until golden brown. Allow loaves to cool on a wire rack.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 20,
  "title": "Onion Bread I",
  "tags": [
   "Grain"
  ],
  "author": "Alma Ackerman",
  "img": "http://images.media-allrecipes.com/userphotos/250x250/340352.jpg",
  "serving": 2,
  "description": "This flavorful loaf of bread gets a savory flavor of onion thanks to the simple addition of a packet of onion soup mix.",
  "ingredients": {
   "": ""
  },
  "instructions": "Warm the milk in a small saucepan until it bubbles, then remove from heat. Let cool until lukewarm. In a large bowl, stir together yeast, warm water, and 1 teaspoon sugar. Set aside to proof. Add milk, 2 2/3 tablespoons sugar, salt, butter or margarine, flour, and soup mix to the yeast in the bowl. Combine until dough forms, and then turn out on a lightly floured surface. Knead until dough is elastic. Oil a large bowl. Place the dough in the bowl, and turn several times to coat. Cover the bowl with a damp cloth, and set aside in a warm place to rise for 30 minutes. Divide dough in half. Shape into loaves, and place into two greased 8 1/2 x 4 1/2 inch bread pans. Set aside to rise for 30 minutes. Bake at 375 degrees F (190 degrees C) for 40 minutes. Loaf will sound hollow when done.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 21,
  "title": "Grandma VanDoren's White Bread",
  "tags": [
   "Grain"
  ],
  "author": "Marilyn VanDoren Sim",
  "img": "http://images.media-allrecipes.com/userphotos/560x315/3261061.jpg",
  "serving": 2,
  "description": "What Grandma used to make!  Our family's favorite.  The recipe was never written down (that I know of) until she shared it with me when she was in her 90's.",
  "ingredients": {
   "": ""
  },
  "instructions": "In a large bowl, combine warm water, yeast, salt, oil, sugar, and 4 cups flour. Mix thoroughly, and let sponge rise until doubled in size. Gradually add about 4 cups flour, kneading until smooth. Place dough in a greased bowl, and turn several times to coat. Cover with a damp cloth. Allow to rise until doubled. Punch down the dough, let it rest a few minutes. Divide dough into three equal parts. Shape into loaves, and place in three 8 1/2 x 4 1/2 inch greased bread pans. Let rise until almost doubled. Bake at 350 degrees F (175 degrees C) for 35 to 45 minutes. The loaves may need to be covered for the last few minutes with foil to prevent excess browning.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 22,
  "title": "Italian Bread I",
  "tags": [
   "Grain"
  ],
  "author": "Shelley Ross",
  "img": "http://images.media-allrecipes.com/userphotos/560x315/422084.jpg",
  "serving": 2,
  "description": "This loaf is easy to prepare for the newcomer to bread-making. There is no yeast, and the bread is very dense.  Great as a side to pasta and salad.",
  "ingredients": {
   "cups buttermilk": "1 1/2"
  },
  "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9 x 5 loaf pan. Whisk together the oil, egg, and buttermilk in a small bowl. In a large bowl, whisk together flour, sugar, baking powder, soda, salt, and dried herbs. Stir in cheese and onions. Pour buttermilk mixture into the flour mixture, and stir to combine. Add garlic and tomatoes until evenly distributed. Spread batter into prepared pan. Smooth top, and tap pan on counter to remove bubbles. Bake for 60 to 65 minutes, until golden. Cool loaf on wire rack.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 23,
  "title": "Sunday Dinner Rolls",
  "tags": [
   "Grain"
  ],
  "author": "Martha Harmo",
  "img": "http://images.media-allrecipes.com/userphotos/250x250/196189.jpg",
  "serving": 2,
  "description": "I make the dough on Saturday night, and shape the rolls on Sunday morning.  The rolls rise while I am at church, and are ready to pop into the oven for Sunday dinner.",
  "ingredients": {
   "": ""
  },
  "instructions": "In a large bowl, stir yeast, 1/4 cup warm water, and a pinch of sugar. In another bowl, beat eggs in 1 cup warm water; add oil and salt. Mix egg mixture into yeast, and add sugar. Gradually add flour. Cover with a damp cloth, and allow to stand at room temperature for 1 hour, then place in the refrigerator and allow to rise overnight. This dough is rather sticky, and will raise to at least twice it's size. Divide the dough into 4 equal parts. Roll each section out into a circle on a floured board or wax paper. Cut into pizza slice shapes, and roll slices large end to small end. Place on greased flat baking pans, and allow to rise for 2 hours. Bake at 375 degrees F (190 degrees C) for 8 minutes.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 24,
  "title": "Banana Wheat Bread",
  "tags": [
   "Grain"
  ],
  "author": "Gladys George",
  "img": "http://images.media-allrecipes.com/userphotos/250x250/202505.jpg",
  "serving": 2,
  "description": "This is a delicious and nutritious bread that is very easy to make.  I like  it so much, I sometimes have it for breakfast!",
  "ingredients": {
   "": ""
  },
  "instructions": "Grease a 9 x 5 inch loaf pan. Preheat oven to 350 degrees (175 degrees C). Combine oil, honey, eggs, vanilla, and mashed bananas in a bowl. In a large bowl, whisk together flour, wheat germ, salt, and baking soda. Make a well in dry ingredients, and add the banana mixture. Mix together until dry ingredients are moistened. Stir in nuts. Pour batter into prepared pan. Bake 1 hour in preheated oven. Test for doneness, and cool on wire rack.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 25,
  "title": "Banana Bread",
  "tags": [
   "Grain"
  ],
  "author": "Nikki",
  "img": "http://images.media-allrecipes.com/userphotos/560x315/4480205.jpg",
  "serving": 2,
  "description": "This is our family favorite.",
  "ingredients": {
   "": ""
  },
  "instructions": "Grease and flour two 7x3 inch loaf pans. Preheat oven to 350 degrees F (175 degrees C). In one bowl, whisk together flour, soda, salt, and sugar. Mix in slightly beaten eggs, melted butter, and mashed bananas. Stir in nuts if desired. Pour into prepared pans. Bake at 350 degrees F (175 degrees C) for 1 hour, or until a wooden toothpick inserted in the center comes out clean.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 26,
  "title": "Candied Fruit Bread",
  "tags": [
   "Grain"
  ],
  "author": "Carol",
  "img": "http://images.media-allrecipes.com/userphotos/250x250/325017.jpg",
  "serving": 2,
  "description": "This is a great bread for tea at Christmas time when you don't like to make fruitcake.  It is an old recipe that belonged to my mother, and really good.",
  "ingredients": {
   "milk": "1 cup"
  },
  "instructions": "Grease an 8 x 5 inch loaf tin thoroughly. Preheat oven to 375 degrees F (190 degrees C). In a small bowl, beat the eggs well. Add milk and melted butter or shortening, and mix well. Sift together flour, baking powder, salt, and cinnamon into a large mixing bowl. Add sugar, prepared fruits and nuts, and mix well. Add egg mixture to fruit and nut mixture, stirring just enough to blend. Turn batter into greased loaf tin. Let stand for 20 minutes. Place pan in center of oven on middle rack. Bake for 60 to 70 minutes. Turn out on wire rack, and allow to cool for several hours before slicing.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 27,
  "title": "Nut and Fruit Bread",
  "tags": [
   "Grain"
  ],
  "author": "Carol",
  "img": "http://images.media-allrecipes.com/userphotos/560x315/4499063.jpg",
  "serving": 2,
  "description": "This is another great holiday bread to make that belonged to my mother.  She sometimes served this one, and it is a very old recipe.  This bread is good the first day, but better the second. You may use dates instead of raisins if you wish.",
  "ingredients": {
   "": ""
  },
  "instructions": "Grease an 8 x 5 inch loaf tin thoroughly. Preheat oven to 350 degrees F (175 degrees C). In a small bowl, beat the egg well. Mix in milk and melted butter or shortening. Sift flour, baking powder, and salt together into a mixing bowl. Add sugar, nuts, raisins and orange rind; mix well. Blend egg mixture into fruit and nut mixture until flour is just moistened. Turn batter into greased loaf tin, and allow to stand for 20 minutes. Place pan in the center of the oven. Bake for 55 to 60 minutes. Turn bread out on wire rack, and cool for several hours before slicing.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 28,
  "title": "Mother's Banana Bread",
  "tags": [
   "Grain"
  ],
  "author": "Carol",
  "img": "http://images.media-allrecipes.com/userphotos/560x315/1032660.jpg",
  "serving": 2,
  "description": "This is an old recipe that belonged to my mother.  I've been making this bread since I was a teenager.  At a candy striper bake sale a doctor bought this bread and said that this was the best banana bread that he had tasted.",
  "ingredients": {
   "": ""
  },
  "instructions": "Grease an 8x4 inch loaf pan. Preheat oven to 350 degrees F (175 degrees C). In a large mixing bowl, sift together flour, baking powder, baking soda, salt, and sugar. Add butter, eggs, nuts, and mashed banana. Beat until well blended. Pour batter into prepared pan and bake about 1 hour, or until a toothpick inserted in the center of the loaf comes out clean.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 29,
  "title": "Pumpernickel Bread I",
  "tags": [
   "Grain"
  ],
  "author": "Clem Zulinski",
  "img": "http://images.media-allrecipes.com/userphotos/250x250/975243.jpg",
  "serving": 2,
  "description": "This recipe makes a loaf that is not the very heavy textured bread made from the book that comes with the bread machine.",
  "ingredients": {
   "": ""
  },
  "instructions": "Place ingredients into the bread machine in order suggested by the manufacturer. Use the Light Crust or Whole Wheat settings. Start the machine.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 30,
  "title": "Buttermilk Bread I",
  "tags": [
   "Grain"
  ],
  "author": "Debbie Symons",
  "img": "http://images.media-allrecipes.com/userphotos/560x315/4460345.jpg",
  "serving": 2,
  "description": "This is a great bread recipe for your bread machine.  It's easy and very good.",
  "ingredients": {
   "": ""
  },
  "instructions": "Place buttermilk, butter or margarine, sugar, salt, flour, whole wheat flour, and yeast into pan of bread machine. Bake on White Bread setting. Cool on wire racks before slicing.",
  "image": "default-recipe.jpg"
 },
 {
  "recipeID": 31,
  "title": "Tiramisuaa",
  "tags": [
   "Beef",
   "Chiken"
  ],
  "author": "Tony",
  "serving": "3",
  "ingredients": {
   "sugar": "1",
   "salt": "1"
  },
  "instructions": "1 idk",
  "image": "default-recipe.jpg",
  "img": "",
  "description": "Verygood"
 }
]